In [1]:
import pandas as pd
import numpy as np

In [3]:
my_df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', sep='\t')

my_df

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [4]:
new_df = my_df[ : 5]
new_df

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [5]:
total_order = [ 32, 46, 33, 12, 88 ]
new_df["total_order"] = total_order
new_df

,order_id,quantity,item_name,choice_description,item_price,total_order
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,32
1,1,1,Izze,[Clementine],$3.39,46
2,1,1,Nantucket Nectar,[Apple],$3.39,33
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,12
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,88

In [18]:
total_order_list = np.array(new_df["total_order"])
prices_list = np.array(new_df["item_price"])

prices_list = [ float(p.replace("$", "")) for p in prices_list ]

# prices_list

total_amount_of_order_items = total_order_list * prices_list

amount = total_amount_of_order_items

In [22]:
new_df["total_amount_of_order_items"] = [ str(f"${a}") for a in amount ]
new_df

,order_id,quantity,item_name,is_avalaible,choice_description,item_price,total_order,total_amount_of_order_items
0,1,1,Chips and Fresh Tomato Salsa,True,NaN,$2.39,32,$76.48
1,1,1,Izze,True,[Clementine],$3.39,46,$155.94
2,1,1,Nantucket Nectar,True,[Apple],$3.39,33,$111.87
3,1,1,Chips and Tomatillo-Green Chili Salsa,True,NaN,$2.39,12,$28.68
4,2,2,Chicken Bowl,True,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,88,$1494.24

In [25]:
# new_df.insert(3, "is_avalaible", [True] * len(new_df))
new_df

,order_id,quantity,item_name,is_avalaible,choice_description,item_price,total_order,total_amount_of_order_items
0,1,1,Chips and Fresh Tomato Salsa,True,NaN,$2.39,32,$76.48
1,1,1,Izze,True,[Clementine],$3.39,46,$155.94
2,1,1,Nantucket Nectar,True,[Apple],$3.39,33,$111.87
3,1,1,Chips and Tomatillo-Green Chili Salsa,True,NaN,$2.39,12,$28.68
4,2,2,Chicken Bowl,True,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,88,$1494.24

In [28]:
md_df = new_df.assign(is_available =[True] * len(new_df))
md_df

,order_id,quantity,item_name,is_avalaible,choice_description,item_price,total_order,total_amount_of_order_items,is_available
0,1,1,Chips and Fresh Tomato Salsa,True,NaN,$2.39,32,$76.48,True
1,1,1,Izze,True,[Clementine],$3.39,46,$155.94,True
2,1,1,Nantucket Nectar,True,[Apple],$3.39,33,$111.87,True
3,1,1,Chips and Tomatillo-Green Chili Salsa,True,NaN,$2.39,12,$28.68,True
4,2,2,Chicken Bowl,True,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,88,$1494.24,True